In [6]:
import pandas as pd
import numpy as np

numbers = [1,2,3]
pd.Series(numbers)

0    1
1    2
2    3
dtype: int64

In [7]:
animals = ['dog', 'cat', None]
pd.Series(animals)

0     dog
1     cat
2    None
dtype: object

In [8]:
numbers = [1,2,None]
pd.Series(numbers)

0    1.0
1    2.0
2    NaN
dtype: float64

In [9]:
print(np.nan)
print(np.nan == np.nan)
print(np.isnan(np.nan))

nan
False
True

In [11]:
dic = {'IT' : "computer science", 'Eng' : "chemical engineering", "Arts" : "music"}
s = pd.Series(dic)
s

IT          computer science
Eng     chemical engineering
Arts                   music
dtype: object

In [12]:
s.index

Index(['IT', 'Eng', 'Arts'], dtype='object')

In [15]:
# index 만들어주기
r = pd.Series(["computer science", "chemical engineering", "music"], index = ["IT", "Eng", "arts"])
r

IT          computer science
Eng     chemical engineering
arts                   music
dtype: object

In [16]:
# Series 접근
s

IT          computer science
Eng     chemical engineering
Arts                   music
dtype: object

In [17]:
s.iloc[2] # index location

'music'

In [18]:
s.iloc[:2]

IT         computer science
Eng    chemical engineering
dtype: object

In [19]:
s.loc['Arts'] # location

'music'

In [22]:
# Numpy and Pandas
np.random.randint(0,4,10)

array([3, 3, 3, 2, 0, 3, 3, 3, 0, 1])

In [23]:
a = pd.Series(np.random.randint(0,1000,10000))
print(a.head())
print(len(a))

0    131
1     90
2    640
3    692
4    223
dtype: int32
10000

In [24]:
# Series 반복문
a = pd.Series(np.random.randint(0,1000,10000))
print(a.head())
print(len(a))

0    722
1     53
2    726
3    789
4    209
dtype: int32
10000

In [25]:
# Add index
s = pd.Series([1,2,3])
print(s)
s.loc['Aninal'] = 'dog'
s

0    1
1    2
2    3
dtype: int64

0           1
1           2
2           3
Aninal    dog
dtype: object

In [27]:
r = pd.Series(["computer science", "chemical engineering", "music"], index = ["IT", "Eng", "arts"])
t = pd.Series(["English"], index = ["Language"])
all = r.append(t)

In [28]:
all

IT              computer science
Eng         chemical engineering
arts                       music
Language                 English
dtype: object

In [29]:
student1 = pd.Series({"name":"kim", "dept":"cs", "year":2})
student2 = pd.Series({"name":"park", "dept":"ee", "year":2})
student3 = pd.Series({"name":"choi", "dept":"media", "year":2})

In [30]:
student1

name    kim
dept     cs
year      2
dtype: object

In [31]:
group = pd.DataFrame([student1, student2, student3])
group

   name   dept  year
0   kim     cs     2
1  park     ee     2
2  choi  media     2

In [32]:
group.index

RangeIndex(start=0, stop=3, step=1)

In [33]:
group.columns

Index(['name', 'dept', 'year'], dtype='object')

In [34]:
#Index 생성
group1 = pd.DataFrame([student1, student2, student3], index = ["member1", "member2", "member3"])
group1

         name   dept  year
member1   kim     cs     2
member2  park     ee     2
member3  choi  media     2

In [35]:
group1.loc["member2"]

name    park
dept      ee
year       2
Name: member2, dtype: object

In [36]:
type(group1.loc["member2"])

pandas.core.series.Series

In [37]:
# Column access
group1['dept']

member1       cs
member2       ee
member3    media
Name: dept, dtype: object

In [38]:
# Boolean indexing 을 이용한 column access
gCols = group1.columns
print(gCols)

Index(['name', 'dept', 'year'], dtype='object')

In [39]:
col = group1.columns == "year"
print(col)
gCols[col]

[False False  True]

Index(['year'], dtype='object')

In [40]:
group1[gCols[col]]

         year
member1     2
member2     2
member3     2

In [41]:
group1[group1.columns[group1.columns != 'year']]

         name   dept
member1   kim     cs
member2  park     ee
member3  choi  media

In [42]:
group1[[True, False, True]]

         name   dept  year
member1   kim     cs     2
member3  choi  media     2

In [43]:
group1[["year", "name"]]

         year  name
member1     2   kim
member2     2  park
member3     2  choi

In [44]:
#Chain operation
print(group1.loc['member2', 'dept'])
print(group1.loc['member2']['dept'])

ee
ee

In [46]:
group1.loc[:,['dept','year']]

          dept  year
member1     cs     2
member2     ee     2
member3  media     2

In [47]:
group1.iloc[:2]

         name dept  year
member1   kim   cs     2
member2  park   ee     2

In [49]:
# Drop rows : row를 없앰
copy_group1 = group1.copy()
print("before : ", copy_group1)
copy_group1 = copy_group1.drop('member1')
print("After : ", copy_group1)
print("Original : ", group1 )

before :           name   dept  year
member1   kim     cs     2
member2  park     ee     2
member3  choi  media     2
After :           name   dept  year
member2  park     ee     2
member3  choi  media     2
Original :           name   dept  year
member1   kim     cs     2
member2  park     ee     2
member3  choi  media     2

In [50]:
# del columns
del copy_group1['year']
copy_group1

         name   dept
member2  park     ee
member3  choi  media

In [51]:
copy_group1['grades'] = None # grades 컬럼쪽 value를 None값으로 채운다
copy_group1

         name   dept grades
member2  park     ee   None
member3  choi  media   None